## Task

In this compulsory task you will clean the country column and parse the date column in the **store_income_data_task.csv** file.

In [49]:
# Load up store_income_data.csv
import pandas as pd
import numpy as np


income_df = pd.read_csv('store_income_data_task.csv')
income_df.dropna()

,id,store_name,store_email,department,income,date_measured,country
3,4,FIRST REPUBLIC BANK,ecanadine3@fc2.com,Automotive,$8928350.04,8-5-2006,Britain/
5,6,"Auburn National Bancorporation, Inc.",ccaldeyroux5@dion.ne.jp,Grocery,$69798987.04,19-9-1999,U.K.
6,7,"Interlink Electronics, Inc.",orodenborch6@skyrock.com,Garden,$22521052.79,8-6-2001,SA
9,10,"Synopsys, Inc.",lcancellieri9@tmall.com,Electronics,$44091294.62,11-7-2006,United Kingdom
15,16,New Home Company Inc. (The),nhinchcliffef@whitehouse.gov,Shoes,$90808764.99,21-4-1993,Britain
...,...,...,...,...,...,...,...
987,988,"Ares Dynamic Credit Allocation Fund, Inc.",fbrocklebankrf@sitemeter.com,Health,$34762898.80,15-12-1989,SA/
989,990,Madison Covered Call & Equity Strategy Fund,nbaikerh@list-manage.com,Electronics,$85704421.13,16-7-1993,UK.
991,992,"Atlantic Capital Bancshares, Inc.",mgribbellrj@symantec.com,Clothing,$83355366.27,13-4-2001,S.A..
995,996,Columbia Sportswear Company,cschooleyrn@sohu.com,Automotive,$52593924.99,7-10-2005,S. AfricaSouth Africa/
997,998,Tortoise Energy Infrastructure Corporation,cbeardshallrp@ow.ly,Health,$1697293.64,25-4-2009,UNITED STATES OF AMERICA

1. Take a look at all the unique values in the "country" column. Then, convert the column to lowercase and remove any trailing white spaces.

In [41]:
#Working out the number of unique countries
income_df['country'].nunique()

# converting all the entries in the 'country' column to be lower case strings
income_df['country']=income_df['country'].str.lower()

# removing all trailing white spaces
income_df['country']=income_df['country'].str.strip()

2. Note that there should only be three separate countries. Eliminate all variations, so that 'South Africa', 'United Kingdom' and 'United States' are the only three countries.

In [42]:
income_df['country'].unique()

#income_df['country'].nunique()

array(['united states/', 'britain', 'united states', 'britain/',
       'united kingdom', 'u.k.', 'sa', 'u.k/', 'america', nan, 's.a.',
       'england', 'uk', 's.a./', 'u.k', 'america/', 'sa.', '', 'uk.',
       'england/', 'united states of america', 'uk/', 'sa/', 'england.',
       'america.', 's.a..', 'united states of america.',
       'united states of america/', 'united states.',
       's. africasouth africa', 'britain.', '/', 'united kingdom.',
       's. africasouth africa/', 'united kingdom/',
       's. africasouth africa.', '.'], dtype=object)

In [43]:
# Libraries
import fuzzywuzzy
from fuzzywuzzy import process
import chardet

# Set seed for reproducibility
np.random.seed(0)

countries=income_df['country'].unique()

# Get the top 10 closest matches to "united kingdom"
matches = fuzzywuzzy.process.extract("uk", countries, limit=10, scorer=fuzzywuzzy.fuzz.token_sort_ratio)

# Inspect matches
matches

[('uk', 100),
 ('uk.', 100),
 ('uk/', 100),
 ('u.k.', 40),
 ('u.k/', 40),
 ('u.k', 40),
 ('united states/', 13),
 ('united states', 13),
 ('united states.', 13),
 ('united kingdom', 12)]

In [44]:
# Function to replace rows in the provided column of the provided DataFrame
# that match the provided string above the provided ratio with the provided string

def replace_matches_in_column(df, column, string_to_match, min_ratio = 90):
    # get a list of unique strings
    strings = df[column].unique()
    
    # Get the top 10 closest matches to our input string
    matches = fuzzywuzzy.process.extract(string_to_match, strings, 
                                         limit=10, scorer=fuzzywuzzy.fuzz.token_sort_ratio)

    # Only get matches with a ratio > 90
    close_matches = [matches[0] for matches in matches if matches[1] >= min_ratio]

    # Get the rows of all the close matches in our dataframe
    rows_with_matches = df[column].isin(close_matches)

    # Replace all rows with close matches with the input matches 
    df.loc[rows_with_matches, column] = string_to_match
    
    # Let us know when the function is done
    print("All done!")

In [51]:
# Putting the function into use
replace_matches_in_column(df=income_df, column='country', string_to_match="united kingdom")
replace_matches_in_column(df=income_df, column='country', string_to_match="united states")
replace_matches_in_column(df=income_df, column='country', string_to_match="united states of america")
replace_matches_in_column(df=income_df, column='country', string_to_match="south africa")
replace_matches_in_column(df=income_df, column='country', string_to_match="uk")
replace_matches_in_column(df=income_df, column='country', string_to_match="england")
replace_matches_in_column(df=income_df, column='country', string_to_match="sa")
replace_matches_in_column(df=income_df, column='country', string_to_match="america")

# Observing the unique countries after replacing the close matches
income_df['country'].nunique()

income_df['country'].unique()

All done!
All done!
All done!
All done!
All done!
All done!
All done!
All done!

array(['united states', 'Britain', 'Britain/', 'united kingdom', 'U.K.',
       'sa', 'U.K/', 'america', nan, ' S.A.', 'england', 'uk', 'S.A./',
       'BRITAIN', 'U.K', 'U.K ', 'S.A. ', 'u.k', ' ', ' Britain',
       'united states of america', 'S.A..', 's.a.', ' U.K', 'Britain ',
       's. africasouth africa', ' S. AfricaSouth Africa',
       'S. AFRICASOUTH AFRICA', 'Britain.', '/', 'S. AfricaSouth Africa/',
       'S.A.', 'S. AfricaSouth Africa ', 'S. AfricaSouth Africa.',
       'S. AfricaSouth Africa', '.', 'britain'], dtype=object)

In [46]:
# Get the top 10 closest matches to "united kingdom"
matches = fuzzywuzzy.process.extract("america", countries, limit=10, scorer=fuzzywuzzy.fuzz.token_sort_ratio)

# Inspect matches
matches

[('america', 100),
 ('america/', 100),
 ('america.', 100),
 ('united states of america', 45),
 ('united states of america.', 45),
 ('united states of america/', 45),
 ('britain', 43),
 ('britain/', 43),
 ('britain.', 43),
 ('s. africasouth africa', 37)]

3. Create a new column called `days_ago` in the DataFrame that is a copy of the 'date_measured' column but instead it is a number that shows how many days ago it was measured from the current date. Note that the current date can be obtained using `datetime.date.today()`.

In [66]:
# Import modules
from datetime import date

#Showing the column 'date_measured'
income_df['date_measured']

#We can see that the date format is in days, month , year
#Therefore we will need to format our dates to %d-%m-%Y

#creating a new column with the parsed dates
income_df['date_parsed'] = pd.to_datetime(income_df['date_measured'], format='%d-%m-%Y')

income_df['date_parsed'].head()

today=date.today()